Revit 2027 API
IFCExternalServiceUIData Properties
The IFCExternalServiceUIData type exposes the following members.
Properties
Name | Description
Document |  return the document
IsReset |  flag to indicate the value has been reset
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
ParamId |  the parameter id
SelectedIFCItem |  The selected IFC Item (can be IFC Entity, or PredefinedType)
Top
See Also
Reference
IFCExternalServiceUIData Class
Autodesk.Revit.UI Namespace